use URFU_TASKS;
INSERT INTO shops VALUES('1', 'UrfuShop', '545334', 'Ул. Мая 13');
INSERT INTO shops VALUES('2', 'bershka', '89122662653', 'ул. Ясная 24');
INSERT INTO schedule VALUES
	('1',1,10,00,22,00,1),
	('1',2,10,00,22,00,1),
	('1',3,10,00,21,00,1),
	('1',4,11,00,22,00,1),
	('1',6,11,30,21,30,0),
	('2',1,13,00,22,00,0),
	('2',2,13,00,22,00,0),
	('2',3,10,00,21,00,0),
	('2',4,12,00,21,00,0),
	('2',5,13,00,22,00,0);
GO

INSERT INTO products(code, name, [description], start_time) VALUES
('01', 'Бомбер', 'Верхняя одежда, тип куртки, созданный для пилотов', convert(datetime,'18-06-12 10:34:09 PM',5)),
('02', 'Поло', 'предмет одежды, имеющий короткую застёжку со стояче-отложным воротником и короткими рукавами', convert(datetime,'18-03-15 11:32:09 AM',5)),
('03', 'Пальто', 'вид зимней и/или демисезонной верхней одежды длинного покроя', convert(datetime,'11-04-14 11:32:09 AM',5)),
('04', 'Дафлкот', 'однобортное пальто прямого силуэта длиной три четверти из плотной шерстяной ткани с капюшоном', convert(datetime,'13-11-13 12:22:33 PM',5)),
('05', 'Рубшка', 'Одежда из лёгкой ткани для верхней части тела', convert(datetime,'23-02-12 03:11:44 PM',5));
GO

INSERT INTO register_buy(shops_code, date_time, prod_id, [count], price, discount, custumer) VALUES
('2', convert(datetime,'2010-01-12',120),7,2,100,0,'Аб-Дитерих Ъ.Ъ'),
('1', convert(datetime,'2010-01-3',120),9,3,4258,24,'Абазинский Насир'),
('1', convert(datetime,'2011-1-1',120),3,2,5448,30,'Абаконович Н.Д'),
('1', convert(datetime,'2010-10-18',120),7,1,4620,33,'Абаконович А.Ц'),
('1', convert(datetime,'2010-01-21',120),7,1,150,0,'Ааронов Ю.Г')
GO